#+TITLE: EMACS CONFIGURATION
#+AUTHOR: Rhyloo
#+OPTIONS: broken-links:t
After all this time... I think is the moment for write a good emacs configuration for the future and for sharing with others.

** Links
   :PROPERTIES:
   :CUSTOM_ID: links
   :END:
        #+begin_src emacs-lisp
          (require 'ol)
            (org-link-set-parameters "hide-link"
                                     :follow #'org-hide-link-open
                                     :export #'org-hide-link-export
                                     ;; :store #'org-hide-link-store-link
                   :complete #'org-hide-link-complete-file)

            (defcustom org-hide-link-complete-file 'hide-link
              "The Emacs command to be used to display a man page."
              :group 'org-link
              :type 'string)

            (defun org-hide-link-open (path _)
              (find-file path))

            (defun org-hide-link-complete-file (&optional arg)
              "Create a file link using completion."
              (let ((file (read-file-name "File: "))
              (pwd (file-name-as-directory (expand-file-name ".")))
              (pwd1 (file-name-as-directory (abbreviate-file-name
                           (expand-file-name ".")))))
                (cond ((equal arg '(16))
                 (concat "hide-link:"
                   (abbreviate-file-name (expand-file-name file))))
                ((string-match
                  (concat "^" (regexp-quote pwd1) "\\(.+\\)") file)
                 (concat "hide-link:" (match-string 1 file)))
                ((string-match
                  (concat "^" (regexp-quote pwd) "\\(.+\\)")
                  (expand-file-name file))
                 (concat "hide-link:"
                   (match-string 1 (expand-file-name file))))
                (t (concat "hide-link:" file)))))

            (defun org-hide-link-export (link description format)
              "Export a man page link from Org files."
              (let ((path (format "¿Buscas algo?"))
                    (desc (or description link)))
                (pcase format
                  (`html (format "<span class = nolinks><a target=\"_blank\" href=\"%s\">%s</a></span>" path desc))
                  (`latex (format "\\href{%s}{%s}" path desc))
                  (`texinfo (format "@uref{%s,%s}" path desc))
                  (`ascii (format "%s (%s)" desc path))
                  (t path))))

                   (defun my/blue-color-link (text)
                     (org-insert-link nil "color:blue" text))

                   (defun my/color-link-region ()
                     (interactive)
                     (if (region-active-p)
                         (my/blue-color-link (buffer-substring-no-properties (region-beginning) (region-end)))
                       (message "There is no active region.")))
            (org-add-link-type
             "color"
             (lambda (path)
               (message (concat "color "
                                (progn (add-text-properties
                                        0 (length path)
                                        (list 'face `((t (:foreground ,path))))
                                        path) path))))
             (lambda (path desc format)
               (cond
                ((eq format 'html)
                 (format "<span style=\"color:%s;\">%s</span>" path desc))
                ((eq format 'latex)
                 (format "\\textcolor{%s}{%s}" path desc)))))
     #+end_src

     #+RESULTS:
     : Created color link.

